
  ///1DATE

  Syntax:

       DATE {CONTINUOUS}
       DATE {time-specification}
       DATE SET

  Explanation:

  The DATE command lets you display and set the date  and  time  of
  day.

  ///2Examples

  A>DATE

       Displays the current date and time.

  A>DATE C

       Displays the date and time continuously.

  A>DATE 08/14/82 10:30:0

       Sets the date and time.

  A>DATE SET

       Prompts for date and time entries.
